In [16]:
from builtins import int

import pandas as pd

In [17]:
pd.__version__

'1.4.4'

In [20]:
given_list = [2,4,5,6,9]

In [21]:
series = pd.Series(given_list)

In [25]:
series

0    2
1    4
2    5
3    6
4    9
dtype: int64

In [26]:
series = pd.Series(given_list, index=[1,3,5,7,9])

In [29]:
series

1    2
3    4
5    5
7    6
9    9
dtype: int64

In [30]:
pd.date_range(start='05-01-2021', end='05-12-2021')

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [45]:
series = pd.Series([x for x in range(2, 12, 2)])

In [48]:
series

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [51]:
series.map(lambda x: x/2)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [52]:
series.apply(lambda x: x/2)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [55]:
dictt = {'name': ['name1', 'name2', 'name3'],
         'age': [22,25,24],
         'occ': ['engineer', 'doctor', 'accountant']}
dataframe = pd.DataFrame(dictt)

In [56]:
dataframe

    name  age         occ
0  name1   22    engineer
1  name2   25      doctor
2  name3   24  accountant

In [57]:
dataframe.transpose()

             0       1           2
name     name1   name2       name3
age         22      25          24
occ   engineer  doctor  accountant

In [58]:
dataframe

    name  age         occ
0  name1   22    engineer
1  name2   25      doctor
2  name3   24  accountant

In [62]:
lists = [[2, 'Name1', 22],
         [1, 'Name2', 25],
         [3, 'Name3', 24]]
dataframe = pd.DataFrame(lists, columns=['id', 'name', 'age'])

In [63]:
dataframe

   id   name  age
0   2  Name1   22
1   1  Name2   25
2   3  Name3   24

In [75]:
dataframe = pd.read_csv('files/data1.csv', sep=';')

In [71]:
dataframe

   id   name  age  occupation
0   1  Name1   20    Engineer
1   2  Name2   25   Physician
2   3  Name3   34  Unemployed
3   4  Name4   27       Nurse

In [76]:
dataframe_customindex = dataframe.set_index('id')

In [80]:
dataframe_customindex

     name  age  occupation
id
1   Name1   20    Engineer
2   Name2   25   Physician
3   Name3   34  Unemployed
4   Name4   27       Nurse

In [81]:
dataframe

   id   name  age  occupation
0   1  Name1   20    Engineer
1   2  Name2   25   Physician
2   3  Name3   34  Unemployed
3   4  Name4   27       Nurse

In [85]:
dataframe_sorted = dataframe.sort_index(ascending=False)

In [86]:
dataframe_sorted

   id   name  age  occupation
3   4  Name4   27       Nurse
2   3  Name3   34  Unemployed
1   2  Name2   25   Physician
0   1  Name1   20    Engineer

In [87]:
dataframe

   id   name  age  occupation
0   1  Name1   20    Engineer
1   2  Name2   25   Physician
2   3  Name3   34  Unemployed
3   4  Name4   27       Nurse

In [90]:
dataframe_sorted = dataframe.sort_values(by=['occupation', 'age'])

In [91]:
dataframe_sorted

   id   name  age  occupation
0   1  Name1   20    Engineer
3   4  Name4   27       Nurse
1   2  Name2   25   Physician
2   3  Name3   34  Unemployed

In [92]:
dataframe

   id   name  age  occupation
0   1  Name1   20    Engineer
1   2  Name2   25   Physician
2   3  Name3   34  Unemployed
3   4  Name4   27       Nurse

In [94]:
dataframe_customindex

     name  age  occupation
id
1   Name1   20    Engineer
2   Name2   25   Physician
3   Name3   34  Unemployed
4   Name4   27       Nurse

In [95]:
dataframe = dataframe_customindex.reset_index()

In [96]:
dataframe

   id   name  age  occupation
0   1  Name1   20    Engineer
1   2  Name2   25   Physician
2   3  Name3   34  Unemployed
3   4  Name4   27       Nurse

In [98]:
dataframe['id']

0    1
1    2
2    3
3    4
Name: id, dtype: int64

In [99]:
dataframe['age']

0    20
1    25
2    34
3    27
Name: age, dtype: int64

In [100]:
dataframe

   id   name  age  occupation
0   1  Name1   20    Engineer
1   2  Name2   25   Physician
2   3  Name3   34  Unemployed
3   4  Name4   27       Nurse

In [157]:
dt = pd.DataFrame(dataframe.values, index=[10,11,12,13], columns=['id', 'name', 'age', 'occ'])

In [192]:
dataframe

   id   name  age  occupation
0   1  Name1   20    Engineer
1   2  Name2   25   Physician
2   3  Name3   34  Unemployed
3   4  Name4   27       Nurse

In [218]:
dataframe.loc[dataframe.age > 26]

   id   name  age  occupation
2   3  Name3   34  Unemployed
3   4  Name4   27       Nurse

In [240]:
dataframe.iloc[[2,3],2].sum()

61

In [242]:
dataframe.groupby('occupation')['age'].mean()

occupation
Engineer      20.0
Nurse         27.0
Physician     25.0
Unemployed    34.0
Name: age, dtype: float64

In [251]:
dtTemp = dataframe

   id   name  age  occupation
0   1  Name1   20    Engineer
1   2  Name2   25   Physician
2   3  Name3   34  Unemployed
3   4  Name4   27       Nurse

In [266]:
company_data = pd.DataFrame(data={'cname': ['Shyam & Co.', 'Ramlal & Bros.', 'Sharma Enterprises', 'Verma Furnitures', 'Rahul Stores'],
                                  'profit': [-10000, 10000, -5000, 15000, 20000]})

In [267]:
company_data

                cname  profit
0         Shyam & Co.  -10000
1      Ramlal & Bros.   10000
2  Sharma Enterprises   -5000
3    Verma Furnitures   15000
4        Rahul Stores   20000

In [262]:
company_data['profit'] = company_data['profit'].apply(lambda profit: profit > 0)

In [269]:
company_data

                cname  profit
0         Shyam & Co.  -10000
1      Ramlal & Bros.   10000
2  Sharma Enterprises   -5000
3    Verma Furnitures   15000
4        Rahul Stores   20000

In [277]:
emp_data = pd.DataFrame(data={'eid': [1,2,3,4,5],
                              'ename': ['Sid', 'Ramesh', 'Ron', 'Harry', 'John Doe'],
                              'stipend': [10000, 10000, 5000, 15000, 0]})
company_data2 = pd.DataFrame(data={'eid': [1,2,3,4],
                                   'postion': ['employee', 'employee', 'intern', 'senior_employee']})

In [278]:
emp_data

   eid     ename  stipend
0    1       Sid    10000
1    2    Ramesh    10000
2    3       Ron     5000
3    4     Harry    15000
4    5  John Doe        0

In [290]:
inner = pd.merge(emp_data, company_data2, how='inner', on='eid')

In [292]:
inner

   eid   ename  stipend          postion
0    1     Sid    10000         employee
1    2  Ramesh    10000         employee
2    3     Ron     5000           intern
3    4   Harry    15000  senior_employee

In [294]:
left = pd.merge(emp_data, company_data2, how='left', on='eid')

In [312]:
left.loc[4, 'stipend'] = -1

In [302]:
left

   eid     ename  stipend          postion
0    1       Sid    10000         employee
1    2    Ramesh    10000         employee
2    3       Ron     5000           intern
3    4     Harry    15000  senior_employee
4    5  John Doe        0               -1

In [308]:
left.loc[4,'postion'] = None

In [315]:
left

   eid     ename  stipend          postion
0    1       Sid    10000         employee
1    2    Ramesh    10000         employee
2    3       Ron     5000           intern
3    4     Harry    15000  senior_employee
4    5  John Doe       -1             None

In [317]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          4 non-null      int64
 1   name        4 non-null      object
 2   age         4 non-null      int64
 3   occupation  4 non-null      object
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [318]:
dataframe.describe()

             id        age
count  4.000000   4.000000
mean   2.500000  26.500000
std    1.290994   5.802298
min    1.000000  20.000000
25%    1.750000  23.750000
50%    2.500000  26.000000
75%    3.250000  28.750000
max    4.000000  34.000000